/* Localized strings (EN) */

"Loading"                                   =           "Loading...";
"Error"                                     =           "Error";
"Cancel"                                    =           "Cancel";
"Error updating stock quotes"               =           "Update failed!";
"Yahoo Finance unavailable"                 =           "Yahoo Finance is unavailable";
"Could not connect to server"               =           "Could not connect to server";
"Check your Internet connection"            =           "Check your Internet connection";
"HTTP bad response"                         =           "HTTP bad response (";

// List of stocks
"List VC:Pull-to-refresh text"              =           "Updating stocks ...";
"Stock quotes updated"                      =           "Stock quotes updated";
"List VC:Quantity text"                     =           "Stock quantity";
"List VC:Stock value text"                  =           "Stock value";
"List VC:Gain/loss value text"              =           "Gain or loss value";
"List VC:Gain/loss percentage text"         =           "Gain or loss (%)";
"List VC:Intraday evolution text"           =           "Intraday evolution (%)";
"List VC:Header No Stocks"                  =           "No stocks \nTap on the '+' button";
"List VC:Footer text"                       =           "Total :   ";
"List VC:Update text"                       =           "Updated: ";

// Search stocks
"Search VC:Placeholder text"                =           "Type a name or stock ID";
"Search VC:No match"                        =           "No stock match your search";
"Search VC:No market"                       =           "No market could be determined for this entry: it cannot be managed in the portfolio";

// Stock detail - no selection
"Detail VC:no item selected"                =           "No stock selected";

// Stock detail - section titles
"Detail VC:section share price"             =           "Share price";
"Detail VC:section intraday evolution"      =           "Intraday evolution";
"Detail VC:section currency rate"           =           "Exchange rate";
"Detail VC:section stock valuation"         =           "Stock valuation";
"Detail VC:section gain or loss"            =           "Gain or loss";

// Stock detail - cell titles
"Detail VC:number of shares"                =           "Number of shares";
"Detail VC:purchase share price"            =           "Purchase price";
"Detail VC:current share price"             =           "Current price";
"Detail VC:intraday change value"           =           "Value";
"Detail VC:intraday change percentage"      =           "Percentage";
"Detail VC:purchase currency rate"          =           "Purchase rate";
"Detail VC:current currency rate"           =           "Current rate";
"Detail VC:cost of stock"                   =           "Purchase cost";
"Detail VC:value of stock"                  =           "Current stock value";
"Detail VC:gain or loss value"              =           "Value";
"Detail VC:gain or loss percentage"         =           "Percentage";
"Detail VC:last quotation Text"             =           "Last quotation: ";

// Stock detail - Action sheet to sell stocks
"Detail VC:AS sell title"                   =           "Do you really want to sell these stocks ?";
"Detail VC:AS sell button"                  =           "Sell the stocks";

// Stock trading textField errors
"Stock Trading VC:incorrect entry title"    =           "Entry error";
"Stock Trading VC:incorrect entry message"  =           "Please check that this field is not empty and does not contain incorrect characters";
"Stock Trading VC:control field title"      =           "Mandatory field";
"Stock Trading VC:control field message"    =           "This field must not be zero";

// Stock purchase information
"Stock Purchase VC:buy button"              =           "Buy";
"Stock Purchase VC:purchase date"           =           "Purchase date";
"Stock Purchase VC:section Purchase"        =           "Purchase information";
"Stock Purchase VC:section Current"         =           "Share Current info";
"Stock Purchase VC:enter info manually"     =           "Please enter the purchase information manually";


// Stock sale information
"Stock Sell VC:sell button"                 =           "Sell";
"Stock Sell VC:section Sale"                =           "Selling information";
"Stock Sell VC:section Current"             =           "Share Current info";
"Stock Sell VC:number of shares"            =           "Number of shares to sell";
"Stock Sell VC:sale date"                   =           "Sale date";
"Stock Sell VC:sell share price"            =           "Selling price";
"Stock Sell VC:sell currency rate"          =           "Selling rate";
"Stock Sell VC:control nb of shares"        =           "Wrong number of shares";
"Stock Sell VC:control nb message"          =           "You cannot sell more shares that you actually own";
"Stock Sell VC:logging title"               =           "New entry in the Sales journal";
"Stock Sell VC:logging message"             =           "The sale of your stocks has been logged in the Sales journal";
"Stock Sell VC:logging message (notif)"     =           "The sale of your stocks has been logged in the Sales journal \n(the corresponding notifications have been removed)";

// Sales Journal
"Sales Journal VC:title"                    =           "Sales journal";
"Sales Journal VC:short title"              =           "Journal";
"Sales Journal VC:Header no entry"          =           "No entry in the Sales journal";
"Sales Journal VC:Total Gain/Loss"          =           "Total Gain/Loss: ";
"Sales Journal VC:sale of"                  =           "Sale of ";
"Sales Journal VC:shares"                   =           "shares";
"Sales Journal VC:at"                       =           "\nat ";
"Sales Journal VC:gain"                     =           "\nGain: ";
"Sales Journal VC:loss"                     =           "\nLoss: ";
"Sales Journal VC:AS title"                 =           "Do you really want to erase the Sales journal ?";
"Sales Journal VC:AS destructive"           =           "Erase all entries";


// Sales Journal detail
"Sales Detail VC:title"                     =           "Sale details";
"Sales Detail VC:selling share price"       =           "Selling price";
"Sales Detail VC:selling currency rate"     =           "Selling rate";
"Sales Detail VC:selling value"             =           "Selling stock value";


// Preferences
"Prefs VC:title"                            =           "Settings";
"Prefs VC:short title"                      =           "Settings";
"Prefs VC:Currency settings"                =           "Portfolio currency";
"Prefs VC:Button cycle settings"            =           "Main screen buttons";
"Prefs VC:Update settings"                  =           "Automatic update";
"Prefs VC:No update"                        =           "No update";
"Prefs VC:Notifications"                    =           "Stock notifications";
"Prefs VC:Theme settings"                   =           "Theme";
"Prefs VC:Credits"                          =           "Credits";
"Prefs VC:Support"                          =           "Support";

// Automatic Update footer
"Automatic update switch:on"                =           "Stocks quotes and currency rates will be automatically updated in the background at regular intervals, and in the foreground if the last update is older than %@ minutes.";
"Automatic update switch:off"               =           "Stocks quotes will not be updated automatically.";

// iCloud footer
"Cloud switch:on"                          =           "Your stocks, sales journal and notifications are saved in iCloud and synced across all your devices.";
"Cloud switch:off"                         =           "Your stocks, sales journal and notifications are saved on this device only.";

// Notifications footer
"Notifications footer"                      =           "Stock Notifications need Background app refresh and Notifications to be enabled in your device Settings.";

// Button cycle selection
"Button Cycle VC:title"                     =           "Button cycle";
"Button Cycle VC:explanation"               =           "Select the performance indicators you want to use in the stocks list, and their cycle order.";
"Button Cycle VC:check last entry"          =           "At least one entry must remain selected";

// Currency picker
"Currency Picker VC:title"                  =           "Currency";
"Currency Picker VC:Reset warning"          =           "Warning! \nChanging the portfolio currency will erase all the stocks of the portfolio !";
"Currency Picker VC:AS title"               =           "Changing the portfolio currency will erase all the stocks of the portfolio !";
"Currency Picker VC:AS destructive"         =           "Reset portfolio";

// Theme selector
"Theme Selector VC:title"                   =           "Theme";

// Stock Notification
"Create Stock Notif Main VC:title"                =           "Create notification";
"Create Stock Notif Main VC:general text"         =           "Create a notification based on the \n%@";
"Create Stock Notif Main VC:share price"          =           "SHARE PRICE";
"Create Stock Notif Main VC:stock value"          =           "STOCK VALUE";
"Create Stock Notif Main VC:gain value"           =           "GAIN OR LOSS VALUE";
"Create Stock Notif Main VC:gain %"               =           "GAIN OR LOSS %";
"Create Stock Notif Main VC:gain"                 =           "GAIN OR LOSS";

"Create Stock Notif Main VC:permissions title"    =           "Missing authorization";
"Create Stock Notif Main VC:notification status"  =           "Please allow Portfolio to send you notifications, in order to be warned when an alert threshold has been reached";
"Create Stock Notif Main VC:background refresh"   =           "Please allow Portfolio to use Background App Refresh, in order to have your stocks updated regularly";
"Settings"                                        =           "Settings";


"Create Stock Notif Target VC:general text"       =           "Notify me when the %1$@ of %2$@ reaches";
"Create Stock Notif Target VC:placeholder"        =           "Enter target value";
"Create Stock Notif Target VC:created"            =           "New notification created";
"Create Stock Notif Target VC:logging message"    =           "You will be notified when the %1$@ of %2$@%3$@%4$@ %5$@";

"Stock Notif List VC:Header no entry"             =           "No entry in the Notification list";
"Stock Notif List VC:Header explain"              =           "\nNB: these notifications will be fired when the stock quotes are updated (including in the background).";
"Stock Notif List VC:Notify me"                   =           "Notify me when the ";
"Stock Notif List VC:of"                          =           " of ";
"Stock Notif List VC:my"                          =           "my ";
"Stock Notif List VC:your"                        =           "your ";
"Stock Notif List VC:goes over"                   =           " goes over ";
"Stock Notif List VC:goes under"                  =           " goes under ";
"Stock Notif List VC:AS title"                    =           "Do you really want to delete all notifications ?";
"Stock Notif List VC:AS destructive"              =           "Delete all notifications";

"Local notification:message (over)"         =           "The %1$@ of %2$@ has gone over %3$@ %4$@";
"Local notification:message (under)"        =           "The %1$@ of %2$@ has gone under %3$@ %4$@";
"Local notification:tap to dismiss"         =           "Slide up to dismiss";

// Release notes
"Release notes title"                       =           "What's new in version %@";


// Support
"Support VC:rate app"                       =           "Rate the app on the App Store";
"Support VC:request support"                =           "Send a mail to the support";
"Support VC:share"                          =           "Tell others about this app";
"Support VC:version"                        =           "Version";
"Support VC:e-mail title"                   =           "ZEN Portfolio: Support request";
"Support VC:e-mail body"                    =           "(Please describe the issue you encountered, if possible with screenshots)";
"Support VC:share text"                     =           "ZEN Portfolio, a simple and efficient stocks manager for iPhone and iPad.\nhttp://itunes.apple.com/app/id576249340?mt=8";

"Support VC:sharing confirm title"          =           "Action performed";
"Support VC:sharing completed"              =           "Thank you for telling other people about ZEN Portfolio!";
"Support VC:mail confirm title"             =           "Mail sent";
"Support VC:mail sent"                      =           "Thank you for your mail! We usually answer support requests within 48 hours.";


// iCloud
// (in StockListTVC)
"iCloud:available"                          =           "iCloud sync available";
"iCloud:cloud storage"                      =           "Automatically store your portfolio in iCloud to keep it up-to-date across all your devices?";
"iCloud:open settings"                      =           "Open Settings";
"iCloud:not now"                            =           "Not now";

// (in PreferencesTVC)
"iCloud:not loggedin"                       =           "Not logged in to iCloud";
"iCloud:not loggedin explanation"           =           "iCloud activation switch cannot be changed until you log in to your iCloud account";
"iCloud:activated"                          =           "iCloud activated";
"iCloud:failed to activate"                 =           "iCloud activation failed";
"iCloud:deactivated"                        =           "iCloud de-activated";
"iCloud:failed to de-activate"              =           "Failed to de-activate iCloud";

"iCloud:conflicting records"                =           "Conflicting records";
"iCloud:conflict explanation"               =           "There are records saved both in iCloud and on your device. Which ones would you like to keep?";
"iCloud:do not activate"                    =           "Don't activate iCloud";
"iCloud:local data"                         =           "Overwrite iCloud with local data";
"iCloud:iCloud data"                        =           "Overwrite local data with iCloud";

"iCloud:records left"                       =           "Records still in iCloud";
"iCloud:records left explanation"           =           "There are still records saved in iCloud. Would you like to keep them (to use them later or on other devices), or delete them definitely?";
"iCloud:leave records"                      =           "Leave records on iCloud";
"iCloud:delete records"                     =           "Delete all records from iCloud";
"iCloud:could not suppress"                 =           "The records could not be suppressed from iCloud. iCloud will be de-activated anyway.";